"""位图消息，作者：Al Sweigart al@inventwithpython.com
根据提供的位图图像显示文本消息。
此代码可在 https://nostarch.com/big-book-small-python-programming 获得
标签：小，初学者，艺术"""

import sys

# (!) 尝试将此多行字符串更改为您喜欢的任何图像：

# 此字符串的顶部和底部有 68 个句点：
# (You can also copy and paste this string from
# （您也可以从 https://inventwithpython.com/bitmapworld.txt 复制并粘贴此字符串）
bitmap = """
....................................................................
   **************   *  *** **  *      ******************************
  ********************* ** ** *  * ****************************** *
 **      *****************       ******************************
          *************          **  * **** ** ************** *
           *********            *******   **************** * *
            ********           ***************************  *
   *        * **** ***         *************** ******  ** *
               ****  *         ***************   *** ***  *
                 ******         *************    **   **  *
                 ********        *************    *  ** ***
                   ********         ********          * *** ****
                   *********         ******  *        **** ** * **
                   *********         ****** * *           *** *   *
                     ******          ***** **             *****   *
                     *****            **** *            ********
                    *****             ****              *********
                    ****              **                 *******   *
                    ***                                       *    *
                    **     *                    *
...................................................................."""

print('Bitmap Message, by Al Sweigart al@inventwithpython.com')
print('Enter the message to display with the bitmap.')
message = input('> ')
if message == '':
    sys.exit()

# 遍历位图中的每一行：
for line in bitmap.splitlines():
    # 循环遍历该行中的每个字符：
    for i, bit in enumerate(line):
        if bit == ' ':
            # 打印一个空白空间，因为位图中有一个空格：
            print(' ', end='')
        else:
            # 从消息中打印一个字符：
            print(message[i % len(message)], end='')
    print()  # 打印换行符。
